[
    {
        "username": "Armida Woodbury  ",
        "date": "2009-12-18T06:00:00.000Z",
        "title": "A great place!",
        "review": "Who do they think they are? I'm a pilot and I stay in many hotels. This is the first time that I've PAID for internet access and was then censored as to what I could view in the privacy of my own room. ",
        "rating": 3.8
    },
    {
        "username": "Tobi Canaday  ",
        "date": "2013-02-12T06:00:00.000Z",
        "title": "So cool.",
        "review": "The rooms were just the right size for 2 adults and 4 children. The boys loved the pool. The staff was excellent, the breakfast was great. The crew that works the breakfast were so nice, and so accomodating.",
        "rating": 4.5
    },
    {
        "username": "Efrain Thong  ",
        "date": "2009-05-07T05:00:00.000Z",
        "title": "Lame",
        "review": "sweltering indoors in phoenix I don't even know where to began.",
        "rating": 4.8
    },
    {
        "username": "Mindy Spiegel  ",
        "date": "2011-09-02T05:00:00.000Z",
        "title": "What is air?",
        "review": "OK but needs renovation I was looking forward to my first stay in an Embassy Suites facility. I was part of a convention contingent who had been booked into the hotel. The neighborhood is not good and if you do not have a car, you are captive to the hotel without other attractions, dining, etc within safe walking distance.",
        "rating": 4.7
    },
    {
        "username": "Walker Walworth  ",
        "date": "2010-10-13T05:00:00.000Z",
        "title": "Did you know?",
        "review": "Also, a couple of duh notes to management:--In the bathroom sink of our room (401), the hot and cold faucets were on the wrong sides. Hot should be on the left. --You can't create a nonsmoking suite simply by calling it so. You need to fumigate everything so it doesn't smell like an old ashtray. ",
        "rating": 1.3
    },
    {
        "username": "Horace Loveless  ",
        "date": "2005-01-21T06:00:00.000Z",
        "title": "Breathtaking",
        "review": "I live in northern Arizona about two hours away from Sky Harbor Airport,and my family and I always stay in a hotel the night before a flight. I have stayed in many airport hotels but will never stay here again.",
        "rating": 3
    },
    {
        "username": "Annetta Kaczynski  ",
        "date": "2010-01-19T06:00:00.000Z",
        "title": "Just the basics.",
        "review": "Mediocre by expected standards, and in the midst of a renovation I stayed at this facility while attending The American Legion's National Convention; this was the property to which our delegation was assigned.",
        "rating": 2.5
    },
    {
        "username": "Meredith Cournoyer  ",
        "date": "2010-07-20T05:00:00.000Z",
        "title": "Google it.",
        "review": "Little fans do not make a hotel luxurious We've stayed in many Embassy Suites across the country before, so we felt fairly confident in booking a suite at this one. There was a bit of difficulty getting to the hotel due to road construction. ",
        "rating": 4.6
    },
    {
        "username": "Carlene Silguero  ",
        "date": "2012-10-16T05:00:00.000Z",
        "title": "Porkchops",
        "review": "Not so lucky. After two hours the room was only down to 77 degrees and it wasn't going any lower. I am on medication and am supposed to watch my heat exposure and I was already way too hot. Then I saw a sign that said you have to pay for internet and local calls. Also not on their website.",
        "rating": 1.4
    },
    {
        "username": "Emely Behrends  ",
        "date": "2011-11-01T05:00:00.000Z",
        "title": "Bookmark this",
        "review": "ark and Ride Rip Off Beware of an offer to park your car at embassy suites as an alternate to Airport parking.",
        "rating": 4.6
    },
    {
        "username": "Dorthea Broaddus  ",
        "date": "2010-04-25T05:00:00.000Z",
        "title": "Will revisit someday",
        "review": "Will not visit anytime soon",
        "rating": 1
    },
    {
        "username": "Felica Wadley  ",
        "date": "2008-05-03T05:00:00.000Z",
        "title": "Amazing for the area",
        "review": "Home away from home!",
        "rating": 4.9
    },
    {
        "username": "Gaynell Trimble  ",
        "date": "2009-08-26T05:00:00.000Z",
        "title": "How is this a site?",
        "review": "A person who is not used to being around people who are financially challenged may be afraid. However, a crime can happen anywhere - rich or poor neighborhood. Each person would have to make an individual call on the neighborhood.Overall, I felt our stay was enjoyable and certainly in line with what we paid. ",
        "rating": 1.8
    },
    {
        "username": "Almeda Krejci  ",
        "date": "2008-12-20T06:00:00.000Z",
        "title": "Unkept",
        "review": "The air conditioner ran the entire time we were there, and was barely doing the job. It was only in the mid 80's, so I can imagine it would be insufficient if it would have been really hot. The bathroom was tiny, to the point where you had to back up to the tub to even shut the door. ",
        "rating": 1.2
    },
    {
        "username": "Leora Thrift  ",
        "date": "2010-01-01T06:00:00.000Z",
        "title": "Pretty decent",
        "review": "Great hotel at reasonable rate",
        "rating": 4.4
    },
    {
        "username": "Veta Mccall  ",
        "date": "2009-04-30T05:00:00.000Z",
        "title": "Lame",
        "review": "Would not stay here again I have stayed at many Embassy Suites, and this is the first one that has disappointed me. We stayed in room 315. It was March and the weather outside was a little cooler than normal, but the room inside was still warm. I tried to turn on the air conditioning, but it would not work. I called the Front Desk. The man told me that they were in Neutral mode which meant that none of the rooms got air conditioning that day. He told me to open the balcony door to let in cool air. At 5:00 pm, all it let in was the hot afternoon sun with no breeze. ",
        "rating": 1.7
    },
    {
        "username": "Margy Fallis  ",
        "date": "2010-12-12T06:00:00.000Z",
        "title": "Oranges",
        "review": "I traveled to Phoenix on business in February and stayed at the Embassy Suites Phoenix Airport for two nights. I was very impressed with the big roomy rooms. I've never stayed in an Embassy Suites before, so I don't know if they are all like this, but it had a front room with a bedroom in the back, a nice desk and TV out front and a separate TV and table in the bedroom. It just seemed very classy and like the kind of place you could actually bear staying at for several days of business or fun.",
        "rating": 5
    },
    {
        "username": "Roxie Branton  ",
        "date": "2005-07-16T05:00:00.000Z",
        "title": "Sticky notes are necessary",
        "review": "Bad Service, Bad Facility, Bad Stay",
        "rating": 1
    },
    {
        "username": "Maisha Curran  ",
        "date": "2011-11-29T06:00:00.000Z",
        "title": "Cat woman lives here",
        "review": "The fitness room was in excellent condition with 2 treadmills, 2 ellipticals, one stationery bike, plenty of free weights, and lots of towels.There were some minor things that I didn't like -- the bathroom in my suite was on the small side; the wifi was not free and on occasion there was difficulty connecting from the meeting rooms;",
        "rating": 2.7
    },
    {
        "username": "Enid Vanleuven  ",
        "date": "2009-09-27T05:00:00.000Z",
        "title": "What a sight",
        "review": "good place to stay stayed last Sat night there - hotel is undergoing renovation - it needs it, but not in a bad way - the hotel is starting to look a little worn, but nothing terrible - just needs some smell things, like touch up on the paint job, and some renovation in the rooms - rooms starting to look a little outdated",
        "rating": 4.5
    },
    {
        "username": "Iliana Littell  ",
        "date": "2013-05-26T05:00:00.000Z",
        "title": "Pretty average",
        "review": "ood for Short Stays or Business I stayed here for four days and three nights on a business trip. When I first arrived I was given a room next to the elevator on the 2nd floor. When I made the reservations it was for a fourth floor room by the pool. ",
        "rating": 3.4
    },
    {
        "username": "Donnette Figueras  ",
        "date": "2012-08-08T05:00:00.000Z",
        "title": "I kind of like it",
        "review": "Great shuttle service We booked through the 800 number and were told we had the last smoking room available.",
        "rating": 3.9
    },
    {
        "username": "Luanne Schack  ",
        "date": "2013-12-21T06:00:00.000Z",
        "title": "Why not?",
        "review": "Enjoyed the Embassy Suites I was a little nervous staying at this Embassy Suites after reading some of the reviews, but was pleasantly surprised. I just returned home after staying there two nights.",
        "rating": 4.8
    },
    {
        "username": "Gabriel Burkey  ",
        "date": "2010-03-07T06:00:00.000Z",
        "title": "Considering this for my wedding",
        "rating": 4.9
    },
    {
        "username": "Margarite Towner  ",
        "date": "2009-07-30T05:00:00.000Z",
        "title": "What is orange",
        "review": "Pleasant Hotel with Big Roomy Rooms... I traveled to Phoenix on business in February and stayed at the Embassy Suites Phoenix Airport for two nights. I was very impressed with the big roomy rooms. I've never stayed in an Embassy Suites before,",
        "rating": 4.3
    },
    {
        "username": "Lianne Zynda  ",
        "date": "2007-02-14T06:00:00.000Z",
        "title": "Best at night",
        "review": "We had two beds, but they were small double beds, not the queens appearing in official photos and implied we would get. I ended up sleeping on the sleeper sofa so my wife and son could rest on a real bed. The sleeper sofa was like sleeping in a hammock without the comfort.",
        "rating": 4.9
    },
    {
        "username": "Glynda Millard  ",
        "date": "2009-06-27T05:00:00.000Z",
        "title": "Great to see cats",
        "review": "Band kids were not well controlled, resturant service bad Husband, dtr, and I stayed here in order to get flight out next morning. Hotel room as expected for Embassy Suites, Noise level on bedroom side from road very loud and disturbing. H.S. band in hotel for Fiesta Bowl were still running wild at 11pm.",
        "rating": 2.5
    },
    {
        "username": "Jermaine Reamer  ",
        "date": "2012-09-14T05:00:00.000Z",
        "title": "Cats live with mice here",
        "review": "The sleeper sofa was like sleeping in a hammock without the comfort. It sagged terribly and the framework pressed very firmly across my chest a hips. It was a very uncomfrtable 7 nights.",
        "rating": 3.1
    },
    {
        "username": "Lina Michener  ",
        "date": "2012-10-04T05:00:00.000Z",
        "title": "I know what i like.",
        "review": "Overall the hotel was nice, although the rooms were somewhat out of date. The lobby was very nice, although the only restrooms were located upstairs.",
        "rating": 2.1
    },
    {
        "username": "Elaina Kies  ",
        "date": "2010-10-13T05:00:00.000Z",
        "title": "Mangos",
        "review": "The official hotel photos looked nice, but the room photos they showed must have been somewhere else in the facility.",
        "rating": 2.4
    },
    {
        "username": "Tad Glasper  ",
        "date": "2008-04-16T05:00:00.000Z",
        "title": "Google this thoroughly",
        "review": "I always stay at Hilton chains, but will never return to this one. ",
        "rating": 4.1
    },
    {
        "username": "Jewel Sansom  ",
        "date": "2010-12-26T06:00:00.000Z",
        "title": "Can't find the hype",
        "review": "Cats",
        "rating": 2.1
    },
    {
        "username": "Irvin Sgro  ",
        "date": "2009-01-29T06:00:00.000Z",
        "title": "Don't listen to the other reviews",
        "review": "There was a Gazebo with misters for outdoor functions.The on-site Agave Grill offered a wonderful free cooked-to-order breakfast every morning. Lunch selections were decent though a bit more expensive than I would like to spend. Dinner selections were expensive and mostly of a Southwest cuisine. You can order off the lunch menu.",
        "rating": 4.6
    },
    {
        "username": "Thanh Bermejo  ",
        "date": "2009-05-12T05:00:00.000Z",
        "title": "I like pie",
        "review": "Never again I've stayed here before. I guess I didn't learn my lesson then. The noise level is unbelievable if you are put in a room on the side that runs along 44th St. We were on the 4th floor and could not hear the TV over the traffic and drunks.",
        "rating": 4.7
    },
    {
        "username": "Sherill Sunseri  ",
        "date": "2012-04-23T05:00:00.000Z",
        "title": "Why visit elsewhere.",
        "review": "The TV was in need of replacement. Viewing selctions (the free ones) were pretty limited. There is a TV in the bedroom.Internet access was available either through an ethernet cable (located by the couch) or wireless. There is a $9.95 charge per 24 hours for use of the Internet (it amazes me that far less expensive properties offer this for free). The wireless connection dropped-off at times, making on-line work difficult at times.The pool was very nice.",
        "rating": 4.8
    },
    {
        "username": "Vernita Desilets  ",
        "date": "2012-06-07T05:00:00.000Z",
        "title": "Do not miss this!",
        "review": "Viewing selctions (the free ones) were pretty limited. There is a TV in the bedroom.Internet access was available either through an ethernet cable (located by the couch) or wireless.",
        "rating": 4.2
    },
    {
        "username": "Cassie Scoggin  ",
        "date": "2006-01-29T06:00:00.000Z",
        "title": "Cookies are closeby",
        "review": "While my room was ready, others in my party waited hours for a room (and we arrived at about 3:30 PM).The official hotel photos looked nice, but the room photos they showed must have been somewhere else in the facility.",
        "rating": 3.9
    },
    {
        "username": "Pamela Pickell  ",
        "date": "2002-02-06T06:00:00.000Z",
        "title": "Great scenery",
        "review": "The photos published by other reviewers were like my room. We had requested a double-double room for three adults.",
        "rating": 4.4
    },
    {
        "username": "Ericka Lessig  ",
        "date": "2010-05-04T05:00:00.000Z",
        "title": "At least the restaurants are nice",
        "review": "Internet access was available either through an ethernet cable (located by the couch) or wireless. There is a $9.95 charge per 24 hours for use of the Internet (it amazes me that far less expensive properties offer this for free). The wireless connection dropped-off at times, making on-line work difficult at times.The pool was very nice. landscaping in the courtyard was enjoyable. ",
        "rating": 1.6
    },
    {
        "username": "Laveta Darosa  ",
        "date": "2010-10-22T05:00:00.000Z",
        "title": "Why bother",
        "review": " The in-room refrigerator was slow in chilling stored beverages or food items. The bathroom is incredibly small; you very nearly had to step over the toilet to get into the shower/bathtub. The beds were small and rock-hard, which - combined with the spotty air conditioning - could make restful sleep problematic. The televisions were old and in poor working order, and the cable system was even worse, as several featured channels were nothing but snow depending on the time of day, or even the room you were watching in.",
        "rating": 1.2
    },
    {
        "username": "Denisha Mousseau  ",
        "date": "2009-10-11T05:00:00.000Z",
        "title": "What is water",
        "review": "General cleanliness of the facilities was so-so. Housekeeping was open to the outside, and cleaned bath towels were stacked near the entry, which almost made laundry pointless. Laundry facilities were also outside; while the washer and dryer units were relatively clean, there was no place to fold or stack. Additionally, quarters were virtually a precious commodity in the hotel, and $1.00 only bought you 20 minutes of drying time.",
        "rating": 4.7
    },
    {
        "username": "Felicita Bernardi  ",
        "date": "2012-03-06T06:00:00.000Z",
        "title": "Where do you see culture?",
        "review": "The air conditioning was spotty at times. The in-room refrigerator was slow in chilling stored beverages or food items. The bathroom is incredibly small; you very nearly had to step over the toilet to get into the shower/bathtub.",
        "rating": 1.5
    },
    {
        "username": "Ping Chea  ",
        "date": "2010-05-05T05:00:00.000Z",
        "title": "Cultural heaven",
        "review": "Mediocre by expected standards, and in the midst of a renovation I stayed at this facility while attending The American Legion's National Convention; this was the property to which our delegation was assigned.",
        "rating": 5
    },
    {
        "username": "Alita Lareau  ",
        "date": "2010-04-09T05:00:00.000Z",
        "title": "Americanized waste",
        "review": "A traveler staying here would definitely need a car to get around. It is an older facility, though would have much promise with a major upgrade. The rooms are relatively spacious, but a bit spartan and worn. The entry doors were marginally secure. The walls were thin, so any external noise from outside or in adjacent rooms were sometimes quite audible.",
        "rating": 2.8
    },
    {
        "username": "Jannette Sleeper  ",
        "date": "2002-02-02T06:00:00.000Z",
        "title": "What culture?",
        "review": "I asked to speak to the woman at the front desk's manager after her poor customer service and he was an even bigger joke. He was loud, rude and unhelpful. Next time I have the pleasure of traveling to Phoenix, I won't ruin it by staying here. ",
        "rating": 2.9
    },
    {
        "username": "Iva Strobl  ",
        "date": "2006-05-05T05:00:00.000Z",
        "title": "I learned so much",
        "review": "she gave us a lower rate than the one I鈥檇 booked which was $75 per night [I understand that July/August are the off season months for Phoenix, thus the lower rate]. I agree with a few of the reviewers that the rooms could be updated some, but ours was very comfortable for the 3 nights",
        "rating": 4.9
    },
    {
        "username": "Cherie Pillar  ",
        "date": "2005-03-04T06:00:00.000Z",
        "title": "Where do you find this?",
        "review": "Not bad, considering location. Overall, not a bad place to stay. The pool was nice although since it was 115 degrees outside, I only used it after 10pm. ",
        "rating": 1.2
    },
    {
        "username": "Lester Trautman  ",
        "date": "2004-01-02T06:00:00.000Z",
        "title": "What is cake",
        "review": " I stayed at the hotel for several hours after my husband, and did find the staff very friendly and the shuttle service to the hotel convenient and efficient. ",
        "rating": 2.2
    },
    {
        "username": "Rosana Vanegas  ",
        "date": "2009-05-05T05:00:00.000Z",
        "title": "I like picky notes",
        "review": "The property was o.k. but there were quite a few problems. You judge for yourself. THE BAD:1)If you don't call early they only give a very limited number of late checkouts and it is only 1 hour more than the regular check out time.",
        "rating": 2.5
    },
    {
        "username": "Rozanne Nease  ",
        "date": "2006-06-06T05:00:00.000Z",
        "title": "Spam",
        "review": "It was only in the mid 80's, so I can imagine it would be insufficient if it would have been really hot. The bathroom was tiny, to the point where you had to back up to the tub to even shut the door. The sink area is in the bedroom, so it is impossible for one to sleep if the other one has to get up.",
        "rating": 2.9
    }
]